---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotComputeRailElevation
source: html/03c31b18-947a-5860-7278-da0cd8949e52.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotComputeRailElevation Property

Can't compute elevation profile for one or more Rails

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotComputeRailElevation { get; }
```